app/Http/Controllers/CategoriesController.php

select * from `categories` order by `category_name` asc
---
    public function browseCategories(){
        $title = trans('app.crowdfunding_categories');
        $categories = Category::orderBy('category_name', 'asc')->get();